# ðŸŽ“ Mini Project â€“ Student Grades Analysis (Day 7)

**Goal:**  
- Practice working with CSV files and Pandas.  
- We will load a dataset of student grades, calculate totals, averages, and perform basic analysis.

# 1. Import Libraries

In [1]:
import pandas as pd

# 2. Load Dataset

In [3]:
df = pd.read_csv("student_grades.csv")
df.head()

      Name  Math  Science  English
0  Zeeshan    85       88       75
1   Samiya    90       76       85
2   Farhan    78       85       80
3   Dimple    88       90       70
4    Meera    92       95       88

# 3. Add Total & Average Score

In [4]:
df["Total"] = df[["Math", "Science", "English"]].sum(axis=1)
df["Average"] = df[["Math", "Science", "English"]].mean(axis=1)
df

      Name  Math  Science  English  Total    Average
0  Zeeshan    85       88       75    248  82.666667
1   Samiya    90       76       85    251  83.666667
2   Farhan    78       85       80    243  81.000000
3   Dimple    88       90       70    248  82.666667
4    Meera    92       95       88    275  91.666667
5   Jasmin    70       72       65    207  69.000000
6      Raj    65       60       68    193  64.333333
7    Priya    80       82       90    252  84.000000

# 4. Descriptive Statistics

In [5]:
print("Summary Statistics:\n", df.describe())

Summary Statistics:
             Math    Science    English       Total    Average
count   8.000000   8.000000   8.000000    8.000000   8.000000
mean   81.000000  81.000000  77.625000  239.625000  79.875000
std     9.665846  11.275764   9.545942   26.521891   8.840630
min    65.000000  60.000000  65.000000  193.000000  64.333333
25%    76.000000  75.000000  69.500000  234.000000  78.000000
50%    82.500000  83.500000  77.500000  248.000000  82.666667
75%    88.500000  88.500000  85.750000  251.250000  83.750000
max    92.000000  95.000000  90.000000  275.000000  91.666667

# 5. Find Top & Lowest Performers

In [6]:
top_student = df.loc[df["Average"].idxmax()]
lowest_student = df.loc[df["Average"].idxmin()]

print("Top Performer:\n", top_student)
print("\nLowest Performer:\n", lowest_student)

Top Performer:
 Name           Meera
Math              92
Science           95
English           88
Total            275
Average    91.666667
Name: 4, dtype: object

Lowest Performer:
 Name             Raj
Math              65
Science           60
English           68
Total            193
Average    64.333333
Name: 6, dtype: object

# 6. Ranking Students

In [7]:
df_sorted = df.sort_values(by="Average", ascending=False)
df_sorted

      Name  Math  Science  English  Total    Average
4    Meera    92       95       88    275  91.666667
7    Priya    80       82       90    252  84.000000
1   Samiya    90       76       85    251  83.666667
0  Zeeshan    85       88       75    248  82.666667
3   Dimple    88       90       70    248  82.666667
2   Farhan    78       85       80    243  81.000000
5   Jasmin    70       72       65    207  69.000000
6      Raj    65       60       68    193  64.333333

# âœ… Summary (Day 7 â€“ Mini Project):

- Loaded student grades dataset from CSV
- Added total & average marks per student
- Generated summary statistics
- Identified top & lowest performers
- Ranked students by average score
- Applied CSV handling + Pandas basics ðŸŽ‰